# Pandas

In [1]:
import pandas as pd

In [31]:
df = pd.read_csv("file1.csv", header=None)

In [32]:
print(df)

     0   1   2   3  4
0    A   B   C   D  T
1    1   2   3   4  1
2    2   1   4   8  1
3    3   0   5   9  1
4    4  -1   6  10  1
5    5  -2   7  11  0
6    6  -3   8  12  1
7    7  -4   9   8  0
8    8  -5  10   9  0
9    9  -6  11  10  0
10  10  -7  12  11  1

In [33]:
df=df.drop([0])
print(df)

     0   1   2   3  4
1    1   2   3   4  1
2    2   1   4   8  1
3    3   0   5   9  1
4    4  -1   6  10  1
5    5  -2   7  11  0
6    6  -3   8  12  1
7    7  -4   9   8  0
8    8  -5  10   9  0
9    9  -6  11  10  0
10  10  -7  12  11  1

In [34]:
df=df.drop([0],axis=1)
print(df)

     1   2   3  4
1    2   3   4  1
2    1   4   8  1
3    0   5   9  1
4   -1   6  10  1
5   -2   7  11  0
6   -3   8  12  1
7   -4   9   8  0
8   -5  10   9  0
9   -6  11  10  0
10  -7  12  11  1

In [36]:
df.columns=["F2","F3","F4","T"]

In [37]:
print(df)

    F2  F3  F4  T
1    2   3   4  1
2    1   4   8  1
3    0   5   9  1
4   -1   6  10  1
5   -2   7  11  0
6   -3   8  12  1
7   -4   9   8  0
8   -5  10   9  0
9   -6  11  10  0
10  -7  12  11  1

In [39]:
df.describe()

        F2  F3  F4   T
count   10  10  10  10
unique  10  10   6   2
top     -7   6   9   1
freq     1   1   2   6

In [43]:
print(df.iloc[0])

F2    2
F3    3
F4    4
T     1
Name: 1, dtype: object
   F2 F3  F4  T
1   2  3   4  1
2   1  4   8  1
3   0  5   9  1
4  -1  6  10  1

In [45]:
print(df.iloc[0:4])

   F2 F3  F4  T
1   2  3   4  1
2   1  4   8  1
3   0  5   9  1
4  -1  6  10  1

In [44]:
df.loc[0:4]

   F2 F3  F4  T
1   2  3   4  1
2   1  4   8  1
3   0  5   9  1
4  -1  6  10  1

In [53]:
col=["F2", "F3"]
print(df[col])

    F2  F3
1    2   3
2    1   4
3    0   5
4   -1   6
5   -2   7
6   -3   8
7   -4   9
8   -5  10
9   -6  11
10  -7  12

In [56]:
print(pd.unique(df["T"]))
print("Number of 1:", (df["T"]==1).sum())

['1' '0']
Number of 1: 0